diskoisland/ESP32_temp_humidity_logger/ESP32_TempHumidity_RTC_Logger_ble.ino
/*
  SparkFun MicroMod ESP32 Temperature/Humidity Logger with hosted webpage,
  microSD logging, RTC sync, watchdog, safe scheduled reboot, event logging,
  and NimBLE Wi-Fi control.

  Hardware assumed:
    - SparkFun MicroMod ESP32 Processor
    - SparkFun MicroMod Data Logging Carrier Board
    - Adafruit SHT-30 mesh-protected weather-proof temperature/humidity sensor,
      Product ID 4099, mounted in a plastic solar radiation shield, I2C address 0x44
    - Adafruit DS3231 Precision RTC - STEMMA QT, address 0x68

  Arduino libraries:
    - Adafruit SHT31 Library
    - RTClib by Adafruit
    - NimBLE-Arduino by h2zero

  BLE commands:
    - WIFI_ON
    - WIFI_OFF
    - STATUS

  Open the serial monitor at 115200 baud after uploading.
  In this NimBLE variant, Wi-Fi starts OFF by default.
  Use BLE command WIFI_ON to start the access point and webpage.
*/

#include "Secrets.h"
#include "BleControl.h"
#include "WifiControl.h"

#include <WebServer.h>
#include <Wire.h>
#include <SPI.h>
#include <SD.h>
#include <Adafruit_SHT31.h>
#include <RTClib.h>
#include <Preferences.h>
#include <esp_task_wdt.h>
#include <esp_arduino_version.h>
#include <esp_heap_caps.h>
#include <esp_system.h>

// -------- BLE settings --------
const char *BLE_DEVICE_NAME = "SHT30-Logger";

// -------- User settings --------
const unsigned long SAMPLE_INTERVAL_MS = 5000;      // Sensor sampling time, 5 sec
const unsigned long LOG_INTERVAL_MS = 60000;        // Logging interval, 1 minute
const unsigned long REBOOT_INTERVAL_MS = 7UL * 24UL * 60UL * 60UL * 1000UL;  // 7 days
const uint16_t MAX_LOG_ROWS = 1440;                 // 24 hours at one-minute averages
const uint32_t WATCHDOG_TIMEOUT_MS = 30000;         // 30 second watchdog

// SparkFun MicroMod ESP32 maps the primary MicroMod/Qwiic I2C bus to GPIO 21/22.
const int I2C_SDA_PIN = 21;
const int I2C_SCL_PIN = 22;

// SparkFun MicroMod ESP32 primary SPI mapping used by the Data Logging Carrier.
const int SD_CS_PIN = 5;
const char *LOG_FILENAME = "/temp_humidity_1min.csv";
const char *EVENT_LOG_FILENAME = "/logger_events.csv";

const char *LOG_CSV_HEADER =
  "timestamp,timezone,utc_offset_minutes,"
  "avg_temperature_c,min_temperature_c,max_temperature_c,"
  "avg_humidity_percent,min_humidity_percent,max_humidity_percent,sample_count";

const char *EVENT_CSV_HEADER =
  "timestamp,timezone,utc_offset_minutes,event,reason,details";

// -------- Globals --------
WebServer server(80);
Adafruit_SHT31 sht31 = Adafruit_SHT31();
RTC_DS3231 rtc;
Preferences prefs;

struct LogRow {
  DateTime timestamp;
  int16_t utcOffsetMinutes;  // UTC offset in effect when this row was logged
  float avgTemperatureC;
  float minTemperatureC;
  float maxTemperatureC;
  float avgHumidity;
  float minHumidity;
  float maxHumidity;
  uint16_t sampleCount;
  bool valid;
};

LogRow logRows[MAX_LOG_ROWS];
uint16_t logWriteIndex = 0;
uint16_t logCount = 0;

unsigned long lastSampleMillis = 0;
unsigned long lastLogMillis = 0;
unsigned long bootMillis = 0;

float latestTemperatureC = NAN;
float latestHumidity = NAN;
DateTime latestTimestamp;
bool latestValid = false;

bool sensorOk = false;
bool sdOk = false;
bool loggingEnabled = false;
bool autoLoggingWanted = false;
bool rebootPending = false;

bool rtcOk = false;
bool rtcLostPower = false;
bool rtcTimeWasBadAtBoot = false;
bool rtcBatteryConcern = false;
bool rtcWasSynced = false;
String rtcSyncTimezone = "Not synced";
int rtcSyncUtcOffsetMinutes = 0;

const char *bootResetReason = "unknown";  // cause of the most recent restart

float sumTemperatureC = 0.0;
float minTemperatureC = NAN;
float maxTemperatureC = NAN;
float sumHumidity = 0.0;
float minHumidity = NAN;
float maxHumidity = NAN;
uint16_t aggregateSampleCount = 0;

// -------- Forward declarations --------
void processBleCommand(const String &command);
String bleStatusText();
void appendEventLog(const char *event, const char *reason, const String &details);
void handleEventCsv();

// -------- Helper functions --------
String twoDigits(int value) {
  if (value < 10) return "0" + String(value);
  return String(value);
}

String formatDateTime(const DateTime &dt) {
  return String(dt.year()) + "-" + twoDigits(dt.month()) + "-" + twoDigits(dt.day()) +
         " " + twoDigits(dt.hour()) + ":" + twoDigits(dt.minute()) + ":" + twoDigits(dt.second());
}

String csvDateTime(const DateTime &dt) {
  return String(dt.year()) + "-" + twoDigits(dt.month()) + "-" + twoDigits(dt.day()) +
         "T" + twoDigits(dt.hour()) + ":" + twoDigits(dt.minute()) + ":" + twoDigits(dt.second());
}

String csvEscape(const String &value) {
  String escaped = value;
  escaped.replace("\"", "\"\"");

  if (escaped.indexOf(',') >= 0 ||
      escaped.indexOf('"') >= 0 ||
      escaped.indexOf('\n') >= 0 ||
      escaped.indexOf('\r') >= 0) {
    escaped = "\"" + escaped + "\"";
  }

  return escaped;
}

void appendEventLog(const char *event, const char *reason, const String &details) {
  Serial.print("Event: ");
  Serial.print(event);
  Serial.print(" / ");
  Serial.print(reason);
  Serial.print(" / ");
  Serial.println(details);

  // Event rows need a reliable timestamp. If the SD card or RTC is missing,
  // the event is still printed to Serial but not written to the event CSV.
  if (!sdOk || !rtcOk) return;

  File file = SD.open(EVENT_LOG_FILENAME, FILE_APPEND);
  if (!file) {
    Serial.println("Could not open event log file.");
    sdOk = false;
    return;
  }

  if (file.size() == 0) {
    file.println(EVENT_CSV_HEADER);
  }

  DateTime now = rtc.now();

  file.print(csvDateTime(now));
  file.print(",");
  file.print(csvEscape(rtcSyncTimezone));
  file.print(",");
  file.print(rtcSyncUtcOffsetMinutes);
  file.print(",");
  file.print(csvEscape(String(event)));
  file.print(",");
  file.print(csvEscape(String(reason)));
  file.print(",");
  file.println(csvEscape(details));

  file.close();
}

// -------- BLE command handling --------
String bleStatusText() {
  String status = "STATUS ";
  status += "wifi=";
  status += isWifiEnabled() ? "on" : "off";
  status += ", logging=";
  status += loggingEnabled ? "on" : "off";
  status += ", sensor=";
  status += sensorOk ? "ok" : "bad";
  status += ", rtc=";
  status += rtcOk ? "ok" : "bad";
  status += ", sd=";
  status += sdOk ? "ok" : "bad";
  status += ", ip=";
  status += isWifiEnabled() ? currentIpAddress() : "none";
  return status;
}

void processBleCommand(const String &command) {
  Serial.print("BLE command received: ");
  Serial.println(command);

  if (command == "WIFI_ON") {
    startWifi();

    if (isWifiEnabled()) {
      appendEventLog("wifi_on", "ble_command", "WIFI_ON");
      sendBleResponse("OK WIFI_ON ip=" + currentIpAddress());
    } else {
      appendEventLog("wifi_on_failed", "ble_command", "WIFI_ON failed");
      sendBleResponse("ERROR WIFI_ON failed");
    }

    return;
  }

  if (command == "WIFI_OFF") {
    stopWifi();
    appendEventLog("wifi_off", "ble_command", "WIFI_OFF");
    sendBleResponse("OK WIFI_OFF");
    return;
  }

  if (command == "STATUS") {
    appendEventLog("status", "ble_command", "STATUS");
    sendBleResponse(bleStatusText());
    return;
  }

  appendEventLog("unknown_ble_command", "ble_command", command);
  sendBleResponse("ERROR Unknown command. Use WIFI_ON, WIFI_OFF, or STATUS.");
}

