diskoisland/ESP32_temp_humidity_logger/ESP32_TempHumidity_RTC_Logger_ble.ino
// -------- Watchdog --------
void setupWatchdog() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  // On Arduino-ESP32 3.x the Task WDT is already initialized by the core at
  // boot, so esp_task_wdt_init() would return ESP_ERR_INVALID_STATE and leave
  // the core defaults in place. Reconfigure the existing WDT instead, and only
  // fall back to init() if the core did not bring it up.
  esp_task_wdt_config_t wdtConfig = {
    .timeout_ms = WATCHDOG_TIMEOUT_MS,
    .idle_core_mask = 0,       // watch only the loop task, not the idle tasks
    .trigger_panic = false
  };

  if (esp_task_wdt_reconfigure(&wdtConfig) == ESP_ERR_INVALID_STATE) {
    esp_task_wdt_init(&wdtConfig);
  }
  esp_task_wdt_add(NULL);  // Add current Arduino loop task to watchdog
#else
  esp_task_wdt_init(WATCHDOG_TIMEOUT_MS / 1000, false);
  esp_task_wdt_add(NULL);
#endif

  Serial.println("Watchdog enabled.");
  appendEventLog("watchdog_setup", "setup", "watchdog enabled");
}

// -------- Persistent config --------
void saveLoggingConfig() {
  prefs.begin("logger", false);
  prefs.putBool("autoLog", autoLoggingWanted);
  prefs.putBool("rtcSynced", rtcWasSynced);
  prefs.putString("tz", rtcSyncTimezone);
  prefs.putInt("utcOffset", rtcSyncUtcOffsetMinutes);
  prefs.end();
}

void loadLoggingConfig() {
  prefs.begin("logger", true);
  autoLoggingWanted = prefs.getBool("autoLog", false);
  rtcWasSynced = prefs.getBool("rtcSynced", false);
  rtcSyncTimezone = prefs.getString("tz", "Not synced");
  rtcSyncUtcOffsetMinutes = prefs.getInt("utcOffset", 0);
  prefs.end();
}

// -------- Sensor aggregation --------
void resetAggregate() {
  sumTemperatureC = 0.0;
  minTemperatureC = NAN;
  maxTemperatureC = NAN;
  sumHumidity = 0.0;
  minHumidity = NAN;
  maxHumidity = NAN;
  aggregateSampleCount = 0;
}

void sampleSensor() {
  // Live readings only need the sensor. Timestamping and aggregation need the
  // RTC, but a dead RTC should not blank out the live temp/humidity display.
  if (!sensorOk) return;

  float temperatureC = sht31.readTemperature();
  float humidity = sht31.readHumidity();

  if (isnan(temperatureC) || isnan(humidity)) {
    latestValid = false;
    appendEventLog("sensor_error", "sample_failed", "SHT-30 returned NaN");
    return;
  }

  latestTemperatureC = temperatureC;
  latestHumidity = humidity;
  if (rtcOk) latestTimestamp = rtc.now();
  latestValid = true;

  if (loggingEnabled && rtcOk) {
    sumTemperatureC += temperatureC;
    sumHumidity += humidity;

    if (aggregateSampleCount == 0) {
      minTemperatureC = temperatureC;
      maxTemperatureC = temperatureC;
      minHumidity = humidity;
      maxHumidity = humidity;
    } else {
      minTemperatureC = min(minTemperatureC, temperatureC);
      maxTemperatureC = max(maxTemperatureC, temperatureC);
      minHumidity = min(minHumidity, humidity);
      maxHumidity = max(maxHumidity, humidity);
    }

    aggregateSampleCount++;
  }
}

void logAggregate() {
  // A pending scheduled reboot normally waits for a completed log row. But if
  // no samples are accumulating (RTC dead or sensor returning NaN), a row will
  // never complete, so don't defer the reboot forever.
  if (rebootPending && (!rtcOk || aggregateSampleCount == 0)) {
    appendEventLog(
      "scheduled_reboot",
      "seven_day_reboot",
      "rebooting without a final log row (no pending samples)"
    );

    Serial.println("Scheduled reboot with no pending samples.");
    delay(100);
    ESP.restart();
  }

  if (!rtcOk || aggregateSampleCount == 0) return;

  DateTime now = rtc.now();
  float avgTemperatureC = sumTemperatureC / aggregateSampleCount;
  float avgHumidity = sumHumidity / aggregateSampleCount;

  logRows[logWriteIndex] = {
    now,
    (int16_t)rtcSyncUtcOffsetMinutes,
    avgTemperatureC,
    minTemperatureC,
    maxTemperatureC,
    avgHumidity,
    minHumidity,
    maxHumidity,
    aggregateSampleCount,
    true
  };

  logWriteIndex = (logWriteIndex + 1) % MAX_LOG_ROWS;
  if (logCount < MAX_LOG_ROWS) logCount++;

  if (sdOk) {
    File file = SD.open(LOG_FILENAME, FILE_APPEND);
    if (file) {
      if (file.size() == 0) {
        file.println(LOG_CSV_HEADER);
      }

      file.print(csvDateTime(now));
      file.print(",");
      file.print(csvEscape(rtcSyncTimezone));
      file.print(",");
      file.print(rtcSyncUtcOffsetMinutes);
      file.print(",");
      file.print(avgTemperatureC, 2);
      file.print(",");
      file.print(minTemperatureC, 2);
      file.print(",");
      file.print(maxTemperatureC, 2);
      file.print(",");
      file.print(avgHumidity, 2);
      file.print(",");
      file.print(minHumidity, 2);
      file.print(",");
      file.print(maxHumidity, 2);
      file.print(",");
      file.println(aggregateSampleCount);
      file.close();
    } else {
      appendEventLog("sd_error", "measurement_log_open_failed", "could not open measurement CSV");
      sdOk = false;
    }
  }

  resetAggregate();

  if (rebootPending) {
    appendEventLog(
      "scheduled_reboot",
      "seven_day_reboot",
      "rebooting after completed log row"
    );

    Serial.println("Scheduled reboot after completed log row.");
    delay(100);
    ESP.restart();
  }
}

// -------- Web handlers --------
void handleStartLogging() {
  if (!rtcOk || !rtcWasSynced || rtcBatteryConcern) {
    appendEventLog(
      "logging_blocked",
      "web_command",
      "start requested but RTC was not synced, invalid, or battery concern was active"
    );

    server.send(400, "text/plain", "Sync RTC and confirm RTC is valid before starting logging.");
    return;
  }

  loggingEnabled = true;
  autoLoggingWanted = true;
  resetAggregate();
  lastLogMillis = millis();

  saveLoggingConfig();

  appendEventLog("logging_start", "web_command", "user pressed Start logging");

  server.send(200, "text/plain", "Logging started.");
}

void handleStopLogging() {
  loggingEnabled = false;
  autoLoggingWanted = false;
  rebootPending = false;
  resetAggregate();

  saveLoggingConfig();

