diskoisland/ESP32_temp_humidity_logger/ESP32_TempHumidity_RTC_Logger_ble.ino
  appendEventLog("logging_stop", "web_command", "user pressed Stop logging");

  server.send(200, "text/plain", "Logging stopped.");
}

String statusJson() {
  DateTime now = rtcOk ? rtc.now() : DateTime(2000, 1, 1, 0, 0, 0);

  // Heap health. largestFreeBlock / freeHeap is the fragmentation indicator:
  // when free heap stays high but the largest block shrinks, the heap is
  // fragmenting. Watch these over days of real use before optimizing further.
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t largestFreeBlock = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);

  String json;
  json.reserve(1024);   // one allocation instead of ~40 reallocs while building
  json = "{";
  json += "\"sensorOk\":";
  json += sensorOk ? "true" : "false";
  json += ",\"rtcOk\":";
  json += rtcOk ? "true" : "false";
  json += ",\"rtcLostPower\":";
  json += rtcLostPower ? "true" : "false";
  json += ",\"rtcTimeWasBadAtBoot\":";
  json += rtcTimeWasBadAtBoot ? "true" : "false";
  json += ",\"rtcBatteryConcern\":";
  json += rtcBatteryConcern ? "true" : "false";
  json += ",\"rtcWasSynced\":";
  json += rtcWasSynced ? "true" : "false";
  json += ",\"rtcSyncTimezone\":\"";
  json += rtcSyncTimezone;
  json += "\"";
  json += ",\"rtcSyncUtcOffsetMinutes\":";
  json += String(rtcSyncUtcOffsetMinutes);
  json += ",\"sdOk\":";
  json += sdOk ? "true" : "false";
  json += ",\"loggingEnabled\":";
  json += loggingEnabled ? "true" : "false";
  json += ",\"autoLoggingWanted\":";
  json += autoLoggingWanted ? "true" : "false";
  json += ",\"rebootPending\":";
  json += rebootPending ? "true" : "false";
  json += ",\"rtcTime\":\"";
  json += rtcOk ? formatDateTime(now) : String("RTC not found");
  json += "\",\"latestValid\":";
  json += latestValid ? "true" : "false";
  json += ",\"temperatureC\":";
  json += String(latestValid ? latestTemperatureC : 0.0, 2);
  json += ",\"humidity\":";
  json += String(latestValid ? latestHumidity : 0.0, 2);
  json += ",\"latestTimestamp\":\"";
  json += latestValid ? formatDateTime(latestTimestamp) : String("No reading yet");
  json += "\",\"logCount\":";
  json += String(logCount);
  json += ",\"wifiEnabled\":";
  json += isWifiEnabled() ? "true" : "false";
  json += ",\"ip\":\"";
  json += currentIpAddress();
  json += "\"";
  json += ",\"freeHeap\":";
  json += String(freeHeap);
  json += ",\"largestFreeBlock\":";
  json += String(largestFreeBlock);
  json += ",\"bootResetReason\":\"";
  json += bootResetReason;
  json += "\"";
  json += "}";

  return json;
}

void handleRoot() {
  static const char html[] PROGMEM = R"rawliteral(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>Data Logger</title>
  <style>
    :root { color-scheme: light dark; font-family: system-ui, -apple-system, BlinkMacSystemFont, "Segoe UI", sans-serif; }
    body { margin: 0; background: #f5f7f8; color: #172026; }
    main { max-width: 920px; margin: 0 auto; padding: 24px; }
    h1 { margin: 0 0 18px; font-size: 30px; }
    .grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(190px, 1fr)); gap: 12px; }
    .card { background: white; border: 1px solid #d7dee2; border-radius: 8px; padding: 16px; }
    .label { color: #52616b; font-size: 13px; }
    .value { font-size: 28px; font-weight: 700; margin-top: 4px; word-break: break-word; }
    .small { font-size: 16px; font-weight: 600; }
    .row { display: flex; gap: 10px; flex-wrap: wrap; margin: 18px 0; }

    button, a.button {
      border: 0;
      border-radius: 8px;
      padding: 11px 14px;
      background: #146c94;
      color: white;
      font-weight: 700;
      text-decoration: none;
      cursor: pointer;
      transition: background 0.2s ease;
    }

    button.secondary, a.secondary {
      background: #146c94;
    }

    button.pressed,
    button.secondary.pressed,
    a.button.pressed,
    a.secondary.pressed {
      background: #238636;
    }

    table { width: 100%; border-collapse: collapse; background: white; border: 1px solid #d7dee2; border-radius: 8px; overflow: hidden; }
    th, td { padding: 10px; border-bottom: 1px solid #e5eaed; text-align: left; }
    th { color: #52616b; font-size: 13px; }
    #message { min-height: 24px; color: #146c94; font-weight: 700; }

    @media (prefers-color-scheme: dark) {
      body { background: #11181d; color: #edf4f7; }
      .card, table { background: #172026; border-color: #31414b; }
      th, td { border-color: #2a3740; }
      .label, th { color: #aab8c0; }
    }
  </style>
</head>
<body>
  <main>
    <h1>Data Logger</h1>

    <section class="grid">
      <div class="card"><div class="label">Temperature</div><div id="temp" class="value">--</div></div>
      <div class="card"><div class="label">Humidity</div><div id="humidity" class="value">--</div></div>
      <div class="card"><div class="label">RTC time</div><div id="rtcTime" class="value small">--</div></div>
      <div class="card"><div class="label">Latest reading</div><div id="latestTime" class="value small">--</div></div>
      <div class="card"><div class="label">microSD logging</div><div id="sdStatus" class="value small">--</div></div>
      <div class="card"><div class="label">Logging state</div><div id="loggingStatus" class="value small">--</div></div>
      <div class="card"><div class="label">SHT-30 sensor</div><div id="sensorStatus" class="value small">--</div></div>
      <div class="card"><div class="label">RTC battery</div><div id="rtcBatteryStatus" class="value small">--</div></div>
      <div class="card"><div class="label">RTC timezone</div><div id="rtcTimezone" class="value small">--</div></div>
      <div class="card"><div class="label">Free heap</div><div id="heapStatus" class="value small">--</div></div>
      <div class="card"><div class="label">Last restart</div><div id="resetReason" class="value small">--</div></div>
    </section>

    <div class="row">
      <button onclick="flashButton(this); syncRtc()">Sync RTC to this device</button>
      <button onclick="flashButton(this); startLogging()">Start logging</button>
      <button onclick="flashButton(this); stopLogging()">Stop logging</button>
      <a class="button" href="/log.csv" onclick="flashButton(this)">Download CSV</a>
      <a class="button" href="/events.csv" onclick="flashButton(this)">Download Events</a>
    </div>

    <div id="message"></div>

    <table>
      <thead>
        <tr>
          <th>Time</th>
          <th>Avg Temp C</th>
          <th>Avg Humidity %</th>
          <th>Samples</th>
        </tr>
      </thead>
      <tbody id="rows"></tbody>
    </table>
  </main>

  <script>
    function flashButton(button) {
      button.classList.add('pressed');

      setTimeout(() => {
        button.classList.remove('pressed');
      }, 2000);
    }

