diskoisland/ESP32_temp_humidity_logger/ESP32_TempHumidity_RTC_Logger_ble.ino
    async function refresh() {
      const status = await fetch('/api/status').then(r => r.json());

      document.getElementById('temp').textContent =
        status.latestValid ? `${status.temperatureC.toFixed(2)} C` : '--';

      document.getElementById('humidity').textContent =
        status.latestValid ? `${status.humidity.toFixed(2)} %` : '--';

      document.getElementById('rtcTime').textContent = status.rtcTime;

      // With no RTC we still show the live reading, but the timestamp would be
      // meaningless, so label it explicitly instead of printing a stale time.
      document.getElementById('latestTime').textContent =
        (status.latestValid && !status.rtcOk) ? 'Live reading (RTC not set)' : status.latestTimestamp;
      document.getElementById('sdStatus').textContent = status.sdOk ? 'Active' : 'No card';
      document.getElementById('sensorStatus').textContent = status.sensorOk ? 'Found / OK' : 'Not found';

      document.getElementById('loggingStatus').textContent =
        status.loggingEnabled
          ? (status.rebootPending ? 'Logging / reboot pending' : 'Logging')
          : 'Stopped';

      document.getElementById('rtcBatteryStatus').textContent =
        status.rtcOk
          ? (status.rtcBatteryConcern ? 'Needs RTC sync / battery check' : 'OK')
          : 'RTC not found';

      document.getElementById('rtcTimezone').textContent =
        status.rtcWasSynced
          ? `${status.rtcSyncTimezone}, UTC${status.rtcSyncUtcOffsetMinutes >= 0 ? '+' : ''}${status.rtcSyncUtcOffsetMinutes / 60}`
          : 'Not synced';

      // Show free heap plus the largest contiguous block. If the two diverge
      // (lots of free heap but a small largest block) the heap is fragmenting.
      const freeKb = (status.freeHeap / 1024).toFixed(1);
      const largestKb = (status.largestFreeBlock / 1024).toFixed(1);
      document.getElementById('heapStatus').textContent = `${freeKb} kB (max block ${largestKb} kB)`;

      document.getElementById('resetReason').textContent = status.bootResetReason;

      const log = await fetch('/api/log').then(r => r.json());

      document.getElementById('rows').innerHTML = log.rows.map(row =>
        `<tr><td>${row.time}</td><td>${row.avgTemperatureC.toFixed(2)}</td><td>${row.avgHumidity.toFixed(2)}</td><td>${row.sampleCount}</td></tr>`
      ).join('');
    }

    async function syncRtc() {
      const now = new Date();
      const timezone = Intl.DateTimeFormat().resolvedOptions().timeZone;
      const utcOffsetMinutes = -now.getTimezoneOffset();

      const params = new URLSearchParams({
        year: now.getFullYear(),
        month: now.getMonth() + 1,
        day: now.getDate(),
        hour: now.getHours(),
        minute: now.getMinutes(),
        second: now.getSeconds(),
        timezone: timezone,
        utcOffsetMinutes: utcOffsetMinutes
      });

      const response = await fetch('/api/sync', {
        method: 'POST',
        headers: {'Content-Type': 'application/x-www-form-urlencoded'},
        body: params
      });

      document.getElementById('message').textContent = await response.text();
      refresh();
    }

    async function startLogging() {
      const response = await fetch('/api/logging/start', { method: 'POST' });
      document.getElementById('message').textContent = await response.text();
      refresh();
    }

    async function stopLogging() {
      const response = await fetch('/api/logging/stop', { method: 'POST' });
      document.getElementById('message').textContent = await response.text();
      refresh();
    }

    refresh();
    setInterval(refresh, 5000);
  </script>
</body>
</html>
)rawliteral";

  server.send_P(200, "text/html", html);
}

void handleStatus() {
  server.send(200, "application/json", statusJson());
}

void handleLogJson() {
  String json;
  json.reserve(4096);   // ~60 rows of JSON in one allocation, avoids realloc churn
  json = "{\"rows\":[";
  uint16_t rowsToShow = min<uint16_t>(logCount, 60);
  bool firstRow = true;

  for (uint16_t i = 0; i < rowsToShow; i++) {
    uint16_t index = (logWriteIndex + MAX_LOG_ROWS - 1 - i) % MAX_LOG_ROWS;
    if (!logRows[index].valid) continue;

    if (!firstRow) json += ",";
    firstRow = false;

    json += "{";
    json += "\"time\":\"" + formatDateTime(logRows[index].timestamp) + "\",";
    json += "\"timezone\":\"" + rtcSyncTimezone + "\",";
    json += "\"utcOffsetMinutes\":" + String(logRows[index].utcOffsetMinutes) + ",";
    json += "\"avgTemperatureC\":" + String(logRows[index].avgTemperatureC, 2) + ",";
    json += "\"minTemperatureC\":" + String(logRows[index].minTemperatureC, 2) + ",";
    json += "\"maxTemperatureC\":" + String(logRows[index].maxTemperatureC, 2) + ",";
    json += "\"avgHumidity\":" + String(logRows[index].avgHumidity, 2) + ",";
    json += "\"minHumidity\":" + String(logRows[index].minHumidity, 2) + ",";
    json += "\"maxHumidity\":" + String(logRows[index].maxHumidity, 2) + ",";
    json += "\"sampleCount\":" + String(logRows[index].sampleCount);
    json += "}";
  }

  json += "]}";
  server.send(200, "application/json", json);
}

void handleLogCsv() {
  if (sdOk && SD.exists(LOG_FILENAME)) {
    File file = SD.open(LOG_FILENAME, FILE_READ);
    if (file) {
      server.sendHeader("Content-Disposition", "attachment; filename=esp32-temp-humidity-log.csv");
      server.streamFile(file, "text/csv");
      file.close();
      return;
    }
  }

  // No SD file: stream the in-RAM ring buffer one row at a time. Building the
  // whole CSV in a single String would be a ~130 KB allocation at full buffer,
  // which can fail outright on a fragmented heap.
  server.sendHeader("Content-Disposition", "attachment; filename=esp32-temp-humidity-log.csv");
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/csv", "");
  server.sendContent(String(LOG_CSV_HEADER) + "\n");

  String row;
  row.reserve(160);

  for (uint16_t i = 0; i < logCount; i++) {
    uint16_t index = (logWriteIndex + MAX_LOG_ROWS - logCount + i) % MAX_LOG_ROWS;
    if (!logRows[index].valid) continue;

