diskoisland/ESP32_temp_humidity_logger/ESP32_TempHumidity_RTC_Logger_ble.ino
    row = csvDateTime(logRows[index].timestamp);
    row += ",";
    row += csvEscape(rtcSyncTimezone);
    row += ",";
    row += String(logRows[index].utcOffsetMinutes);
    row += ",";
    row += String(logRows[index].avgTemperatureC, 2);
    row += ",";
    row += String(logRows[index].minTemperatureC, 2);
    row += ",";
    row += String(logRows[index].maxTemperatureC, 2);
    row += ",";
    row += String(logRows[index].avgHumidity, 2);
    row += ",";
    row += String(logRows[index].minHumidity, 2);
    row += ",";
    row += String(logRows[index].maxHumidity, 2);
    row += ",";
    row += String(logRows[index].sampleCount);
    row += "\n";

    server.sendContent(row);
    esp_task_wdt_reset();   // keep long downloads from tripping the watchdog
  }

  server.sendContent("");   // terminate the chunked response
}

void handleEventCsv() {
  if (sdOk && SD.exists(EVENT_LOG_FILENAME)) {
    File file = SD.open(EVENT_LOG_FILENAME, FILE_READ);
    if (file) {
      server.sendHeader("Content-Disposition", "attachment; filename=logger-events.csv");
      server.streamFile(file, "text/csv");
      file.close();
      return;
    }
  }

  String csv = String(EVENT_CSV_HEADER) + "\n";
  server.sendHeader("Content-Disposition", "attachment; filename=logger-events.csv");
  server.send(200, "text/csv", csv);
}

bool argInRange(const String &name, int minValue, int maxValue) {
  if (!server.hasArg(name)) return false;
  int value = server.arg(name).toInt();
  return value >= minValue && value <= maxValue;
}

void handleSyncRtc() {
  if (!rtcOk) {
    server.send(503, "text/plain", "RTC is not available.");
    return;
  }

  if (!argInRange("year", 2024, 2099) ||
      !argInRange("month", 1, 12) ||
      !argInRange("day", 1, 31) ||
      !argInRange("hour", 0, 23) ||
      !argInRange("minute", 0, 59) ||
      !argInRange("second", 0, 59)) {
    server.send(400, "text/plain", "Invalid time from browser.");
    return;
  }

  if (!server.hasArg("timezone") || !server.hasArg("utcOffsetMinutes")) {
    server.send(400, "text/plain", "Missing browser timezone information.");
    return;
  }

  DateTime browserTime(
    server.arg("year").toInt(),
    server.arg("month").toInt(),
    server.arg("day").toInt(),
    server.arg("hour").toInt(),
    server.arg("minute").toInt(),
    server.arg("second").toInt()
  );

  rtc.adjust(browserTime);

  rtcSyncTimezone = server.arg("timezone");
  rtcSyncUtcOffsetMinutes = server.arg("utcOffsetMinutes").toInt();
  rtcWasSynced = true;

  // Syncing makes the RTC usable for this session.
  // If the coin cell is actually bad, rtcLostPower will be detected again
  // after the next full power cycle.
  rtcLostPower = false;
  rtcTimeWasBadAtBoot = false;
  rtcBatteryConcern = false;

  saveLoggingConfig();
  sampleSensor();

  appendEventLog(
    "rtc_sync",
    "web_command",
    "RTC synced from browser device using timezone " + rtcSyncTimezone
  );

  server.send(200, "text/plain", "RTC synced to this device: " + formatDateTime(browserTime));
}

// -------- Setup helpers --------
void setupRoutes() {
  server.on("/", HTTP_GET, handleRoot);
  server.on("/api/status", HTTP_GET, handleStatus);
  server.on("/api/log", HTTP_GET, handleLogJson);
  server.on("/log.csv", HTTP_GET, handleLogCsv);
  server.on("/events.csv", HTTP_GET, handleEventCsv);
  server.on("/api/sync", HTTP_POST, handleSyncRtc);
  server.on("/api/logging/start", HTTP_POST, handleStartLogging);
  server.on("/api/logging/stop", HTTP_POST, handleStopLogging);

  // In the NimBLE variant, server.begin() is called only when Wi-Fi is enabled
  // inside WifiControl.cpp.
}

void setupSdCard() {
  sdOk = SD.begin(SD_CS_PIN);
  if (!sdOk) return;

  if (!SD.exists(LOG_FILENAME)) {
    File file = SD.open(LOG_FILENAME, FILE_WRITE);
    if (file) {
      file.println(LOG_CSV_HEADER);
      file.close();
    } else {
      sdOk = false;
      return;
    }
  }

  if (!SD.exists(EVENT_LOG_FILENAME)) {
    File file = SD.open(EVENT_LOG_FILENAME, FILE_WRITE);
    if (file) {
      file.println(EVENT_CSV_HEADER);
      file.close();
    } else {
      Serial.println("Could not create event log file.");
    }
  }
}

void checkScheduledReboot() {
  if (millis() - bootMillis < REBOOT_INTERVAL_MS) return;

  if (loggingEnabled) {
    if (!rebootPending) {
      appendEventLog(
        "scheduled_reboot_pending",
        "seven_day_reboot",
        "waiting until after next completed log row"
      );
    }

    rebootPending = true;
    return;
  }

  appendEventLog(
    "scheduled_reboot",
    "seven_day_reboot",
    "rebooting while logging stopped"
  );

  Serial.println("Scheduled reboot while logging stopped.");
  delay(100);
  ESP.restart();
}

// Maps the ESP32 reset cause to a short slug for the boot event. "brownout"
// means the supply dipped below the safe threshold (a real power problem);
// "sw_restart" is the normal scheduled reboot / ESP.restart(); the watchdog
// and panic cases indicate a hang or crash rather than a power event.
const char *resetReasonText(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON:   return "poweron";
    case ESP_RST_EXT:       return "external_pin";
    case ESP_RST_SW:        return "sw_restart";
    case ESP_RST_PANIC:     return "panic";
    case ESP_RST_INT_WDT:   return "int_watchdog";
    case ESP_RST_TASK_WDT:  return "task_watchdog";
    case ESP_RST_WDT:       return "other_watchdog";
    case ESP_RST_DEEPSLEEP: return "deep_sleep_wake";
    case ESP_RST_BROWNOUT:  return "brownout";
    case ESP_RST_SDIO:      return "sdio";
    default:                return "unknown";
  }
}

// -------- Arduino setup / loop --------
void setup() {
  Serial.begin(115200);
  delay(500);

  bootMillis = millis();
  loadLoggingConfig();

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(100000);   // 100 kHz for reliable I2C with SHT-30 cable + RTC
  Wire.setTimeOut(100);    // Avoid long I2C lockups

  sensorOk = sht31.begin(0x44);
  rtcOk = rtc.begin();

  setupSdCard();

  Serial.println();
  Serial.println("ESP32 Temperature/Humidity Logger - NimBLE Wi-Fi Variant");
  Serial.println(sensorOk ? "SHT-30 found." : "SHT-30 not found. Check wiring/address.");
  Serial.println(rtcOk ? "DS3231 RTC found." : "DS3231 RTC not found. Check wiring.");
  Serial.println(sdOk ? "microSD logging enabled." : "microSD card not found; logging recent readings in RAM only.");

