diskoisland/ESP32_temp_humidity_logger/ESP32_TempHumidity_RTC_Logger_ble.ino
  if (rtcOk) {
    DateTime bootRtcTime = rtc.now();

    rtcLostPower = rtc.lostPower();
    rtcTimeWasBadAtBoot = bootRtcTime.year() < 2020;
    rtcBatteryConcern = rtcLostPower || rtcTimeWasBadAtBoot;

    if (rtcBatteryConcern) {
      Serial.println("RTC time invalid or lost power. Sync RTC and check/replace coin cell battery if this repeats.");
    }
  } else {
    rtcBatteryConcern = true;
  }

  bootResetReason = resetReasonText(esp_reset_reason());
  Serial.print("Reset reason: ");
  Serial.println(bootResetReason);

  appendEventLog(
    "boot",
    bootResetReason,
    String("sensor=") + (sensorOk ? "ok" : "bad") +
    ", rtc=" + (rtcOk ? "ok" : "bad") +
    ", sd=" + (sdOk ? "ok" : "bad") +
    ", resetReason=" + bootResetReason +
    ", rtcLostPower=" + (rtcLostPower ? "true" : "false") +
    ", rtcTimeWasBadAtBoot=" + (rtcTimeWasBadAtBoot ? "true" : "false")
  );

  setupWatchdog();

  if (autoLoggingWanted && rtcOk && !rtcBatteryConcern && rtcWasSynced) {
    loggingEnabled = true;
    resetAggregate();
    lastLogMillis = millis();
    Serial.println("Auto-resuming logging after reboot.");
    appendEventLog("logging_start", "auto_resume", "logging resumed after reboot");
  } else {
    loggingEnabled = false;
  }

  setupRoutes();
  setupWifiControl(&server, AP_SSID, AP_PASSWORD);
  startBle(BLE_DEVICE_NAME);

  // Wi-Fi starts off by default in the NimBLE variant.
  // Send BLE command WIFI_ON to enable the webpage.

  resetAggregate();
  sampleSensor();

  lastSampleMillis = millis();
  lastLogMillis = millis();
}

void loop() {
  // Execute any BLE command on the main task (never on the NimBLE host task).
  String bleCommand;
  if (takeBleCommand(bleCommand)) {
    processBleCommand(bleCommand);
  }

  if (isWifiEnabled()) {
    server.handleClient();
  }

  unsigned long nowMillis = millis();

  if (nowMillis - lastSampleMillis >= SAMPLE_INTERVAL_MS) {
    lastSampleMillis = nowMillis;
    sampleSensor();
  }

  if (loggingEnabled && nowMillis - lastLogMillis >= LOG_INTERVAL_MS) {
    lastLogMillis = nowMillis;
    logAggregate();
  }

  checkWifiAutoOff();
  ensureBleAdvertising();
  checkScheduledReboot();

  esp_task_wdt_reset(); // reset the dog
}
